# Data Cleaning & Preprocessing with Pandas

## Task List

1. **Identify missing values** 🤔
2. **Drop rows with missing values** 💸
3. **Drop columns with missing values** 🗑️
4. **Fill missing values** 📝
5. **Forward/Backward fill** 🔄
6. **Interpolate missing values** 📈
7. **Convert data type** 🔄
8. **Transform values** 🎉
9. **Normalize (Min-Max)** 📊
10. **Standardize (z-score)** 📈
11. **Identify duplicates** 🔍
12. **Drop duplicates** 💸
13. **Drop duplicates (specific columns)** 🗑️
14. **Lowercase strings** 📝
15. **Remove spaces** 💻
16. **Replace substring** 🔄
17. **Extract substring** 📊
18. **Convert to datetime** 🕰️
19. **Extract year/month/day** 📆
20. **Filter by date range** 📅
21. **One-hot encoding** 📊
22. **Label encoding** 📈
23. **Group categories** 🗑️
24. **Merge DataFrames** 🤝
25. **Concatenate (vertical)** 📋
26. **Concatenate (horizontal)** 📊
27. **Create new column** 📝
28. **Discretize (bin)** 📊
29. **Polynomial features** 📈

## Let's get started! 💻

In [249]:
import numpy as np
import pandas as pd
from numpy import random

1. Identify missing values in the DataFrame.

In [103]:
#data set generated by GEN AI
data = {
    'A': [1, 2, 9, 4, 5],
    'B': [9, 2, 3, np.nan, 5],
    'C': [1, np.nan, np.nan, 4, 5],
    'D': [1, 2, 3, 4, np.nan]
}
df = pd.DataFrame(data)
print(f"Data Frame:\n{df}")
print(f"Missing values in each column:\n{df.isnull().sum()}")

Data Frame:
   A    B    C    D
0  1  9.0  1.0  1.0
1  2  2.0  NaN  2.0
2  9  3.0  NaN  3.0
3  4  NaN  4.0  4.0
4  5  5.0  5.0  NaN
Missing values in each column:
A    0
B    1
C    2
D    1
dtype: int64

2. Drop rows with any missing values.

In [104]:
#data set generated by GEN AI
data = {
    'A': [1, 2, 4, 4, 5],
    'B': [np.nan, 2, 3, np.nan, 5],
    'C': [1, np.nan, np.nan, 4, 5],
    'D': [1, 2, 3, 4, 3]
}
df = pd.DataFrame(data)
print(f"Data Frame:\n{df}")
print(f"Missing values in each row:\n{df.dropna(axis = 0)}")

Data Frame:
   A    B    C  D
0  1  NaN  1.0  1
1  2  2.0  NaN  2
2  4  3.0  NaN  3
3  4  NaN  4.0  4
4  5  5.0  5.0  3
Missing values in each column:
   A    B    C  D
4  5  5.0  5.0  3

3. Drop columns with any missing values.

In [105]:
#data set generated by GEN AI
data = {
    'A': [1, 2, 4, 4, 5],
    'B': [np.nan, 2, 3, np.nan, 5],
    'C': [1, np.nan, np.nan, 4, 5],
    'D': [1, 2, 3, 4, 3]
}
df = pd.DataFrame(data)
print(f"Data Frame:\n{df}")
print(f"Missing values in each column:\n{df.dropna(axis = 1)}")

Data Frame:
   A    B    C  D
0  1  NaN  1.0  1
1  2  2.0  NaN  2
2  4  3.0  NaN  3
3  4  NaN  4.0  4
4  5  5.0  5.0  3
Missing values in each column:
   A  D
0  1  1
1  2  2
2  4  3
3  4  4
4  5  3

4. Fill missing values with a specific value.

In [107]:
#data set generated by GEN AI
data = {
    'A': [1, 2, 4, 4, 5],
    'B': [np.nan, 2, 3, np.nan, 5],
    'C': [1, np.nan, np.nan, 4, 5],
    'D': [1, 2, 3, 4, 3]
}
df = pd.DataFrame(data)
print(f"Data Frame:\n{df}")
print(f"Filled the missing values:\n{df.fillna(4)}")

Data Frame:
   A    B    C  D
0  1  NaN  1.0  1
1  2  2.0  NaN  2
2  4  3.0  NaN  3
3  4  NaN  4.0  4
4  5  5.0  5.0  3
Filled the missing values:
   A    B    C  D
0  1  4.0  1.0  1
1  2  2.0  4.0  2
2  4  3.0  4.0  3
3  4  4.0  4.0  4
4  5  5.0  5.0  3

5. Fill missing values using forward fill and backward fill methods.

In [114]:
#data set generated by GEN AI
data = {
    'A': [1, 2, 4, 4, 5],
    'B': [np.nan, 2, 3, np.nan, 5],
    'C': [1, np.nan, np.nan, 4, 5],
    'D': [1, 2, 3, 4, 3]
}
df = pd.DataFrame(data)
print(f"Data Frame:\n{df}")
print(f"Forward Fill:\n{df.ffill()}") #propagate forward to fill the missing values
print(f"Backward Fill:\n{df.bfill()}") # propagate backword to fill the missin values

Data Frame:
   A    B    C  D
0  1  NaN  1.0  1
1  2  2.0  NaN  2
2  4  3.0  NaN  3
3  4  NaN  4.0  4
4  5  5.0  5.0  3
Forward Fill:
   A    B    C  D
0  1  NaN  1.0  1
1  2  2.0  1.0  2
2  4  3.0  1.0  3
3  4  3.0  4.0  4
4  5  5.0  5.0  3
Backward Fill:
   A    B    C  D
0  1  2.0  1.0  1
1  2  2.0  4.0  2
2  4  3.0  4.0  3
3  4  5.0  4.0  4
4  5  5.0  5.0  3

6. Interpolate missing values.

In [115]:
#data set generated by GEN AI
data = {
    'A': [1, 2, 4, 4, 5],
    'B': [np.nan, 2, 3, np.nan, 5],
    'C': [1, np.nan, np.nan, 4, 5],
    'D': [1, 2, 3, 4, 3]
}
df = pd.DataFrame(data)
print(f"Data Frame:\n{df}")
print(f"Interpolated the missing values:\n{df.interpolate()}")

Data Frame:
   A    B    C  D
0  1  NaN  1.0  1
1  2  2.0  NaN  2
2  4  3.0  NaN  3
3  4  NaN  4.0  4
4  5  5.0  5.0  3
Interpolated the missing values:
   A    B    C  D
0  1  NaN  1.0  1
1  2  2.0  2.0  2
2  4  3.0  3.0  3
3  4  4.0  4.0  4
4  5  5.0  5.0  3

7. Convert a column to a different data type.

In [131]:
#data set generated by GEN AI
data = {
    'A': [1, 2, 4, 4, 5],
    'B': [np.nan, 2, 3, np.nan, 5],
    'C': [1, np.nan, np.nan, 4, 5],
    'D': [1, 2, 3, 4, 3]
}
df = pd.DataFrame(data)
print(f"Data Frame:\n{df.dtypes}\n")
print(f"Column A datatype changed from int to float:\n{df.astype({'A':'float'}).dtypes}")

Data Frame:
A      int64
B    float64
C    float64
D      int64
dtype: object

Column A datatype changed from int to float:
A    float64
B    float64
C    float64
D      int64
dtype: object

8. Apply a function to transform the values of a column.

In [136]:
#data set generated by GEN AI
data = {
    'A': [1, 2, 4, 4, 5],
    'B': [np.nan, 2, 3, np.nan, 5],
    'C': [1, np.nan, np.nan, 4, 5],
    'D': [1, 2, 3, 4, 3]
}
df = pd.DataFrame(data)
print(f"Data Frame:\n{df}\n")
print(f"transforming each value with the addition of 1:\n{df.transform(lambda x: x+1)}")

Data Frame:
   A    B    C  D
0  1  NaN  1.0  1
1  2  2.0  NaN  2
2  4  3.0  NaN  3
3  4  NaN  4.0  4
4  5  5.0  5.0  3

transforming each value with the addition of 1:
   A    B    C  D
0  2  NaN  2.0  2
1  3  3.0  NaN  3
2  5  4.0  NaN  4
3  5  NaN  5.0  5
4  6  6.0  6.0  4

9. Normalize a column using Min-Max scaling.

In [37]:
#dataframe
df = pd.read_csv('C:/Users/faizr/Data-Science-Group-2---BWF---FAIZ-RAZA/Task 12/diabetes (1).csv')
print(f"Original Age column:\n{df['Age']}\n")

#min-max scaling is value-min/max-min
min_max = (df['Age'] - df['Age'].min() / df['Age'].max() - df['Age'].min())
print(f"Min-Max scaling of column Age:\n{round(min_max,2)}")

Original Age column:
0      50
1      31
2      32
3      21
4      33
       ..
763    63
764    27
765    30
766    47
767    23
Name: Age, Length: 768, dtype: int64

Min-Max scaling of column Age:
0      28.74
1       9.74
2      10.74
3      -0.26
4      11.74
       ...
763    41.74
764     5.74
765     8.74
766    25.74
767     1.74
Name: Age, Length: 768, dtype: float64

10. Standardize a column (z-score normalization).

In [41]:
#dataframe
df = pd.read_csv('C:/Users/faizr/Data-Science-Group-2---BWF---FAIZ-RAZA/Task 12/diabetes (1).csv')
print(f"Original Age column:\n{df['Age']}\n")

#min-max scaling is value-mean/std
min_max = (df['Age'] - df['Age'].mean() / df['Age'].std())
print(f"Standardization of column Age:\n{round(min_max,2)}")

Original Age column:
0      50
1      31
2      32
3      21
4      33
       ..
763    63
764    27
765    30
766    47
767    23
Name: Age, Length: 768, dtype: int64

Standardization of column Age:
0      47.17
1      28.17
2      29.17
3      18.17
4      30.17
       ...
763    60.17
764    24.17
765    27.17
766    44.17
767    20.17
Name: Age, Length: 768, dtype: float64

11. Identify duplicate rows in the DataFrame.

In [53]:
data = {
    'ID': [1, 2, 3, 4, 5, 2, 3, 4, 1, 6],
    'Name': ['John', 'Alice', 'Bob', 'Emma', 'Jack', 'Alice', 'Bob', 'Emma', 'John', 'Ryan'],
    'Age': [25, 30, 28, 22, 35, 30, 28, 22, 25, 40]
}

df = pd.DataFrame(data)
print(f"Dataset:\n{df}\n")
#identify duplicate rows based on all columns
dupli = df[df.duplicated()]
print(f"Duplicate Rows:\n{dupli}")

Dataset:
   ID   Name  Age
0   1   John   25
1   2  Alice   30
2   3    Bob   28
3   4   Emma   22
4   5   Jack   35
5   2  Alice   30
6   3    Bob   28
7   4   Emma   22
8   1   John   25
9   6   Ryan   40

Duplicate Rows:
   ID   Name  Age
5   2  Alice   30
6   3    Bob   28
7   4   Emma   22
8   1   John   25

12. Drop duplicate rows.

In [62]:
data = {
    'ID': [1, 2, 3, 4, 5, 2, 3, 4, 1, 6],
    'Name': ['John', 'Alice', 'Bob', 'Emma', 'Jack', 'Alice', 'Bob', 'Emma', 'John', 'Ryan'],
    'Age': [25, 30, 28, 22, 35, 30, 28, 22, 25, 40]
}

df = pd.DataFrame(data)
print(f"Dataset:\n{df}\n")
#identify duplicate rows based on all columns
dupli = df.drop_duplicates()
print(f"Duplicate Rows Droped:\n{dupli}")

Dataset:
   ID   Name  Age
0   1   John   25
1   2  Alice   30
2   3    Bob   28
3   4   Emma   22
4   5   Jack   35
5   2  Alice   30
6   3    Bob   28
7   4   Emma   22
8   1   John   25
9   6   Ryan   40

Duplicate Rows Droped:
   ID   Name  Age
0   1   John   25
1   2  Alice   30
2   3    Bob   28
3   4   Emma   22
4   5   Jack   35
9   6   Ryan   40

13. Drop duplicate rows based on specific columns.

In [71]:
data = {
    'ID': [1, 2, 3, 4, 5, 2, 3, 4, 1, 6, 1, 2, 3, 4, 5, 2, 3, 4, 1, 6],
    'Name': ['John', 'Alice', 'Bob', 'Emma', 'Jack', 'Alice', 'Bob', 'Emma', 'John', 'Ryan', 'John', '1Alice', '1Bob', '1Emma', 'J1ack', 'Al1ice', 'B1ob', 'Em1ma', 'J1ohn', 'Ryan'],
    'Age': [25, 30, 28, 22, 35, 30, 28, 22, 25, 40, 25, 30, 28, 22, 35, 30, 28, 22, 25, 40]
}

df = pd.DataFrame(data)
print(f"Dataset:\n{df}\n")
#identify duplicate rows based on Age columns
dupli = df.drop_duplicates('Age')
print(f"Duplicate Rows Droped based on Age:\n{dupli}")

Dataset:
    ID    Name  Age
0    1    John   25
1    2   Alice   30
2    3     Bob   28
3    4    Emma   22
4    5    Jack   35
5    2   Alice   30
6    3     Bob   28
7    4    Emma   22
8    1    John   25
9    6    Ryan   40
10   1    John   25
11   2  1Alice   30
12   3    1Bob   28
13   4   1Emma   22
14   5   J1ack   35
15   2  Al1ice   30
16   3    B1ob   28
17   4   Em1ma   22
18   1   J1ohn   25
19   6    Ryan   40

Duplicate Rows Droped based on Age:
   ID   Name  Age
0   1   John   25
1   2  Alice   30
2   3    Bob   28
3   4   Emma   22
4   5   Jack   35
9   6   Ryan   40

14. Convert all string values in a column to lowercase.

In [81]:
data = {
    'ID': [1, 2, 3, 4, 5, 2, 3, 4, 1, 6],
    'Name': ['John', 'Alice', 'Bob', 'Emma', 'Jack', 'Alice', 'Bob', 'Emma', 'John', 'Ryan'],
    'Age': [25, 30, 28, 22, 35, 30, 28, 22, 25, 40]
}

df = pd.DataFrame(data)
print(f"Dataset:\n{df}\n")
#lower the str
print(f"Duplicate Rows Droped:\n{df['Name'].str.lower()}")

Dataset:
   ID   Name  Age
0   1   John   25
1   2  Alice   30
2   3    Bob   28
3   4   Emma   22
4   5   Jack   35
5   2  Alice   30
6   3    Bob   28
7   4   Emma   22
8   1   John   25
9   6   Ryan   40

Duplicate Rows Droped:
0     john
1    alice
2      bob
3     emma
4     jack
5    alice
6      bob
7     emma
8     john
9     ryan
Name: Name, dtype: object

15. Remove leading and trailing spaces from string values in a column.

In [84]:
data = {
    'ID': [1, 2, 3, 4, 5, 2, 3, 4, 1, 6],
    'Name': ['    John', 'Alice      ', 'Bob', 'Emma', 'Jack', 'Alice', 'Bob', 'Emma', 'John', 'Ryan'],
    'Age': [25, 30, 28, 22, 35, 30, 28, 22, 25, 40]
}

df = pd.DataFrame(data)
print(f"Dataset:\n{df}\n")
#Remove the spaces
print(f"Duplicate Rows Droped:\n{df['Name'].str.strip()}")

Dataset:
   ID         Name  Age
0   1         John   25
1   2  Alice         30
2   3          Bob   28
3   4         Emma   22
4   5         Jack   35
5   2        Alice   30
6   3          Bob   28
7   4         Emma   22
8   1         John   25
9   6         Ryan   40

Duplicate Rows Droped:
0     John
1    Alice
2      Bob
3     Emma
4     Jack
5    Alice
6      Bob
7     Emma
8     John
9     Ryan
Name: Name, dtype: object

16. Replace a specific substring in a column with another substring.

In [97]:
data = {
    'ID': [1, 2, 3, 4, 5, 2, 3, 4, 1, 6],
    'Name': ['John', 'Alice', 'Bob', 'Emma', 'Jack', 'Alice', 'Bob', 'Emma', 'John', 'Ryan'],
    'Age': [25, 30, 28, 22, 35, 30, 28, 22, 25, 40]
}

df = pd.DataFrame(data)
print(f"Dataset:\n{df['Name']}\n")
#lower the str
rep = df['Name'].replace('John', 'Faiz')
print(f"Replace the John with faiz: \n{rep}")

Dataset:
0     John
1    Alice
2      Bob
3     Emma
4     Jack
5    Alice
6      Bob
7     Emma
8     John
9     Ryan
Name: Name, dtype: object

Replace the John with faiz:
0     Faiz
1    Alice
2      Bob
3     Emma
4     Jack
5    Alice
6      Bob
7     Emma
8     Faiz
9     Ryan
Name: Name, dtype: object

17. Extract a substring from each value in a column.

In [106]:
data = {
    'ID': [1, 2, 3, 4, 5, 2, 3, 4, 1, 6],
    'Name': ['John', 'Alice', 'Bob', 'Emma', 'Jack', 'Alice', 'Bob', 'Emma', 'John', 'Ryan'],
    'Age': [25, 30, 28, 22, 35, 30, 28, 22, 25, 40]
}

df = pd.DataFrame(data)
print(f"Dataset:\n{df['Name']}\n")
#lower the str
rep = df['Name'].str[:2]
print(f"Extracted the substring from the columnn: \n{rep}")

Dataset:
0     John
1    Alice
2      Bob
3     Emma
4     Jack
5    Alice
6      Bob
7     Emma
8     John
9     Ryan
Name: Name, dtype: object

Extracted the substring from the columnn:
0    Jo
1    Al
2    Bo
3    Em
4    Ja
5    Al
6    Bo
7    Em
8    Jo
9    Ry
Name: Name, dtype: object

18. Convert a column to datetime format.

In [128]:
data = {
    'Date': ['2022-01-01 10:00:00', '2022-01-15 12:30:00', '2022-02-20 14:45:00',
             '2022-03-12 16:00:00', '2022-04-05 10:15:00', '2022-05-18 11:30:00']
}
df = pd.DataFrame(data)
print(f"The data type before: \n{df.info()}\n")
print(f"The data type After: \n{pd.to_datetime(df['Date'])}")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    6 non-null      object
dtypes: object(1)
memory usage: 180.0+ bytes
The data type before:
None

The data type After:
0   2022-01-01 10:00:00
1   2022-01-15 12:30:00
2   2022-02-20 14:45:00
3   2022-03-12 16:00:00
4   2022-04-05 10:15:00
5   2022-05-18 11:30:00
Name: Date, dtype: datetime64[ns]

19. Extract year, month, and day from a datetime column.

In [150]:
data = {
    'Date': ['2022-01-01 10:00:00', '2022-01-15 12:30:00', '2022-02-20 14:45:00',
             '2022-03-12 16:00:00', '2022-04-05 10:15:00', '2022-05-18 11:30:00']
}
df = pd.DataFrame(data)

df['Date'] = pd.to_datetime(df['Date'])
print(f"Old Data: \n{df}\n")
df['Year'] = df['Date'].dt.year
df['Month'] = df['Date'].dt.month
df['day'] = df['Date'].dt.day
print(f"Extracted the Year, Month and day:\n{df}")

Old Data:
                 Date
0 2022-01-01 10:00:00
1 2022-01-15 12:30:00
2 2022-02-20 14:45:00
3 2022-03-12 16:00:00
4 2022-04-05 10:15:00
5 2022-05-18 11:30:00

Extracted the Year, Month and day:
                 Date  Year  Month  day
0 2022-01-01 10:00:00  2022      1    1
1 2022-01-15 12:30:00  2022      1   15
2 2022-02-20 14:45:00  2022      2   20
3 2022-03-12 16:00:00  2022      3   12
4 2022-04-05 10:15:00  2022      4    5
5 2022-05-18 11:30:00  2022      5   18

20. Filter rows based on a date range.

In [209]:
#dataset
df = pd.read_csv('ML.csv')
#Renaming the columnn name 
df.rename(columns = {'date': 'Date'}, inplace = True)

df['Date'] = pd.to_datetime(df['Date'])

print(f"Old Data: \n{df.head()}\n")

df['Year'] = df['Date'].dt.year
df['Month'] = df['Date'].dt.month
df['day'] = df['Date'].dt.day

print(f"Extracted the Year, Month and day:\n{df.head()}\n") #extracted years, months and day

print(f"Filtered Dataset:\n{df[(df['Month'] == 7) & (df['day'] == 10)].head()}") #filtered dataset

Old Data:
  typeofaction  sourceid  destinationid  amountofmoney                Date  \
0      cash-in     30105          28942         494528 2019-07-19 14:40:00
1      cash-in     30105           8692         494528 2019-05-17 14:57:00
2      cash-in     30105          60094         494528 2019-07-20 13:20:00
3      cash-in     30105          20575         494528 2019-07-03 14:15:00
4      cash-in     30105          45938         494528 2019-05-26 10:40:00

   isfraud typeoffraud
0        1       type1
1        1       type1
2        1       type1
3        1       type1
4        1       type1

Extracted the Year, Month and day:
  typeofaction  sourceid  destinationid  amountofmoney                Date  \
0      cash-in     30105          28942         494528 2019-07-19 14:40:00
1      cash-in     30105           8692         494528 2019-05-17 14:57:00
2      cash-in     30105          60094         494528 2019-07-20 13:20:00
3      cash-in     30105          20575         494528 2019-07-03 14:15:00
4      cash-in     30105          45938         494528 2019-05-26 10:40:00

   isfraud typeoffraud  Year  Month  day
0        1       type1  2019      7   19
1        1       type1  2019      5   17
2        1       type1  2019      7   20
3        1       type1  2019      7    3
4        1       type1  2019      5   26

Filtered Dataset:
    typeofaction  sourceid  destinationid  amountofmoney                Date  \
61       cash-in     92735          83840         306537 2019-07-10 12:19:00
143      cash-in     37177          33994         362164 2019-07-10 15:04:00
213      cash-in     39284          29925         274171 2019-07-10 10:07:00
285      cash-in     24041          46541         322413 2019-07-10 13:44:00
670     transfer     52566           8509        6654803 2019-07-10 15:55:00

     isfraud typeoffraud  Year  Month  day
61         1       type1  2019      7   10
143        1       type1  2019      7   10
213        1       type1  2019      7   10
285        1       type1  2019      7   10
670        1       type2  2019      7   10

21. Convert a categorical column to numerical using one-hot encoding.

In [210]:
#df is already loaded
print(f"first rows of df:\n{df.head()}\n")
#one hot encoding usnig pandas
print("One hot endoing of typeofaction columnn")
pd.get_dummies(df, columns=['typeofaction'],dtype=int).head()

first rows of df:
  typeofaction  sourceid  destinationid  amountofmoney                Date  \
0      cash-in     30105          28942         494528 2019-07-19 14:40:00
1      cash-in     30105           8692         494528 2019-05-17 14:57:00
2      cash-in     30105          60094         494528 2019-07-20 13:20:00
3      cash-in     30105          20575         494528 2019-07-03 14:15:00
4      cash-in     30105          45938         494528 2019-05-26 10:40:00

   isfraud typeoffraud  Year  Month  day
0        1       type1  2019      7   19
1        1       type1  2019      5   17
2        1       type1  2019      7   20
3        1       type1  2019      7    3
4        1       type1  2019      5   26

One hot endoing of typeofaction columnn

,sourceid,destinationid,amountofmoney,Date,isfraud,typeoffraud,Year,Month,day,typeofaction_cash-in,typeofaction_transfer
0,30105,28942,494528,2019-07-19 14:40:00,1,type1,2019,7,19,1,0
1,30105,8692,494528,2019-05-17 14:57:00,1,type1,2019,5,17,1,0
2,30105,60094,494528,2019-07-20 13:20:00,1,type1,2019,7,20,1,0
3,30105,20575,494528,2019-07-03 14:15:00,1,type1,2019,7,3,1,0
4,30105,45938,494528,2019-05-26 10:40:00,1,type1,2019,5,26,1,0

22. Convert a categorical column to numerical using label encoding.

In [211]:
#df is already loaded
print(f"first rows of df:\n{df.head()}\n")
#one hot encoding usnig pandas
df['typeofaction']= df['typeofaction'].map({'cash-in':0, 'transfer':1})
print("label endoing of typeofaction columnn")

df

first rows of df:
  typeofaction  sourceid  destinationid  amountofmoney                Date  \
0      cash-in     30105          28942         494528 2019-07-19 14:40:00
1      cash-in     30105           8692         494528 2019-05-17 14:57:00
2      cash-in     30105          60094         494528 2019-07-20 13:20:00
3      cash-in     30105          20575         494528 2019-07-03 14:15:00
4      cash-in     30105          45938         494528 2019-05-26 10:40:00

   isfraud typeoffraud  Year  Month  day
0        1       type1  2019      7   19
1        1       type1  2019      5   17
2        1       type1  2019      7   20
3        1       type1  2019      7    3
4        1       type1  2019      5   26

label endoing of typeofaction columnn

,typeofaction,sourceid,destinationid,amountofmoney,Date,isfraud,typeoffraud,Year,Month,day
0,0,30105,28942,494528,2019-07-19 14:40:00,1,type1,2019,7,19
1,0,30105,8692,494528,2019-05-17 14:57:00,1,type1,2019,5,17
2,0,30105,60094,494528,2019-07-20 13:20:00,1,type1,2019,7,20
3,0,30105,20575,494528,2019-07-03 14:15:00,1,type1,2019,7,3
4,0,30105,45938,494528,2019-05-26 10:40:00,1,type1,2019,5,26
...,...,...,...,...,...,...,...,...,...,...
2335,1,14945,43793,106907,2019-03-29 14:53:00,0,none,2019,3,29
2336,1,9532,43793,106907,2019-04-13 13:19:00,0,none,2019,4,13
2337,1,27332,43793,106907,2019-05-10 09:34:00,0,none,2019,5,10
2338,1,32685,43793,106907,2019-07-08 12:20:00,0,none,2019,7,8
2339,1,26390,43793,106907,2019-03-25 13:52:00,0,none,2019,3,25

23. Group values in a categorical column and create a new column with grouped categories.

In [218]:
#dataset generated by gen AI
data = {
    'color': ['red', 'pink', 'blue', 'green', 'red', 'pink', 'blue', 'green', 'yellow', 'purple'],
    'value': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
}

df = pd.DataFrame(data)
print(f"Dataset:\n{df}\n")

df['Colour group'] = df.color.map({'red':'dark', 'pink':'light', 'blue':'dark', 'green':'light', 'yellow': 'light', 'purple': 'dark'})
print(f"created a group of different colors:\n{df}")

Dataset:
    color  value
0     red     10
1    pink     20
2    blue     30
3   green     40
4     red     50
5    pink     60
6    blue     70
7   green     80
8  yellow     90
9  purple    100

created a group of different colors:
    color  value Colour group
0     red     10         dark
1    pink     20        light
2    blue     30         dark
3   green     40        light
4     red     50         dark
5    pink     60        light
6    blue     70         dark
7   green     80        light
8  yellow     90        light
9  purple    100         dark

24. Merge two DataFrames based on a common column.

In [223]:
# dataset generated by gen AI
data = {
    'user_id': [1, 2, 3, 4, 5, 1, 2, 3],
    'order_date': ['2022-01-01', '2022-01-05', '2022-01-10', '2022-01-15', '2022-01-20', '2022-02-01', '2022-02-05', '2022-02-10'],
    'total': [100, 200, 300, 400, 500, 150, 250, 350]
}
data2 = {
    'user_id': [1, 2, 3, 4, 5],
    'name': ['John', 'Mary', 'David', 'Emily', 'Sarah'],
    'email': ['john@example.com', 'mary@example.com', 'david@example.com', 'emily@example.com', 'sarah@example.com']
}
df_orders = pd.DataFrame(data)
df_users = pd.DataFrame(data2)

#merge on the UID of user_id
pd.merge(df_orders, df_users, on='user_id')

   user_id  order_date  total   name              email
0        1  2022-01-01    100   John   john@example.com
1        1  2022-02-01    150   John   john@example.com
2        2  2022-01-05    200   Mary   mary@example.com
3        2  2022-02-05    250   Mary   mary@example.com
4        3  2022-01-10    300  David  david@example.com
5        3  2022-02-10    350  David  david@example.com
6        4  2022-01-15    400  Emily  emily@example.com
7        5  2022-01-20    500  Sarah  sarah@example.com

25. Concatenate two DataFrames vertically.

In [230]:
data = {
    'region': ['North'] * 5,
    'product': ['A', 'B', 'C', 'D', 'E'],
    'sales': [100, 200, 300, 400, 500]
}
data2 = {
    'region': ['South'] * 5,
    'product': ['F', 'G', 'H', 'I', 'J'],
    'sales': [600, 700, 800, 900, 1000]
}
df_north = pd.DataFrame(data)
df_south = pd.DataFrame(data2)
#concatenation of the dataset
print("Concatenation of the dataset: ")
pd.concat([df_north, df_south])

Concatenation of the dataset:

  region product  sales
0  North       A    100
1  North       B    200
2  North       C    300
3  North       D    400
4  North       E    500
0  South       F    600
1  South       G    700
2  South       H    800
3  South       I    900
4  South       J   1000

26. Concatenate two DataFrames horizontally.

In [231]:
data = {
    'region': ['North'] * 5,
    'product': ['A', 'B', 'C', 'D', 'E'],
    'sales': [100, 200, 300, 400, 500]
}
data2 = {
    'region': ['South'] * 5,
    'product': ['F', 'G', 'H', 'I', 'J'],
    'sales': [600, 700, 800, 900, 1000]
}
df_north = pd.DataFrame(data)
df_south = pd.DataFrame(data2)
#concatenation of the dataset
print("Concatenation of the dataset: ")
pd.concat([df_north, df_south],axis=1)

Concatenation of the dataset:

  region product  sales region product  sales
0  North       A    100  South       F    600
1  North       B    200  South       G    700
2  North       C    300  South       H    800
3  North       D    400  South       I    900
4  North       E    500  South       J   1000

27. Create a new column based on existing columns.

In [241]:
data = {
    'region': ['North'] * 5,
    'product': ['A', 'B', 'C', 'D', 'E'],
    'sales': [100, 200, 300, 400, 500]
}
data2 = {
    'region': ['South'] * 5,
    'product': ['F', 'G', 'H', 'I', 'J'],
    'sales': [600, 700, 800, 900, 1000]
}
df_north = pd.DataFrame(data)
df_south = pd.DataFrame(data2)
#concatenation of the dataset

df = pd.concat([df_north, df_south],axis=1)
print(f"Concatenation of the dataset:\n {df}\ ")
df['Total_sales'] = df.iloc[:,2]+df.iloc[:,5]
print(f"new dataset: \n{df}")

Concatenation of the dataset:
   region product  sales region product  sales
0  North       A    100  South       F    600
1  North       B    200  South       G    700
2  North       C    300  South       H    800
3  North       D    400  South       I    900
4  North       E    500  South       J   1000\
new dataset:
  region product  sales region product  sales  Total_sales
0  North       A    100  South       F    600          700
1  North       B    200  South       G    700          900
2  North       C    300  South       H    800         1100
3  North       D    400  South       I    900         1300
4  North       E    500  South       J   1000         1500

28. Discretize a continuous column into bins.

In [258]:
import pandas as pd
import numpy as np

# generate a sample dataset
data = {'values': [18, 25, 30, 35, 40, 45, 50, 55, 60, 65]}
df = pd.DataFrame(data)
#bins create of the continous value
pd.cut(df['values'], bins = [0,10,20,30,40,50,60,70])

0    (10, 20]
1    (20, 30]
2    (20, 30]
3    (30, 40]
4    (30, 40]
5    (40, 50]
6    (40, 50]
7    (50, 60]
8    (50, 60]
9    (60, 70]
Name: values, dtype: category
Categories (7, interval[int64, right]): [(0, 10] < (10, 20] < (20, 30] < (30, 40] < (40, 50] < (50, 60] < (60, 70]]

29. Create polynomial features from existing numerical columns.

In [265]:
#df is already defined
#apply polynomial features
df['Poly of 3'] = df.iloc[:,0] ** 3
print(f"Polynomial of features with poly 3:\n{df}")

Polynomial of features with poly 3:
   values  Poly of 3
0      18       5832
1      25      15625
2      30      27000
3      35      42875
4      40      64000
5      45      91125
6      50     125000
7      55     166375
8      60     216000
9      65     274625

# Practicle Application
# Data Preprocessor

A command-line application for preprocessing datasets using pandas. Perform various tasks such as identifying missing values, dropping rows/columns, filling missing values, transforming data, filtering, and aggregating. Save the processed data to a new file.

## Features:

* Load dataset from CSV or Excel file
* Identify missing values
* Drop rows/columns with missing values
* Fill missing values with a specific value
* Transform data (e.g., convert data types, apply functions)
* Filter data based on specific conditions
* Aggregate data (e.g., group by, calculate mean)
* Save processed data to a new file

## Usage:

* Load the application and select a task to perform
* Follow the prompts to complete the task
* Save the processed data to a new file

## Benefits:

* Easy to use command-line interface
* Perform various data preprocessing tasks in one application
* Save time and increase productivity
* Output processed data in a new file for further analysis or use

In [267]:
df = pd.read_csv('dataset.csv')
df

      Name  Age  Gender    Country  Score
0     John   25    Male        USA     80
1     Mary   31  Female         UK     90
2    David   42    Male  Australia     70
3    Emily   35  Female     Canada     85
4    Sarah   28  Female    Germany     95
5  Michael   40    Male        USA     75
6     Lisa   29  Female         UK     80
7     Paul   38    Male  Australia     85
8    Laura   32  Female     Canada     90
9    Kevin   45    Male    Germany     70

In [277]:
# Load dataset from CSV file
df = pd.read_csv('dataset.csv')

# Identify missing values
missing_values = df.isnull().sum()
print(missing_values)

# Drop rows with missing values
df = df.dropna()
print(df)

# Drop columns with missing values
df = df.dropna(axis=1)
print(df)

# Fill missing values with a specific value
df = df.fillna('Unknown')
print(df)

# Filter data based on specific conditions
filtered_df = df[df['Age'] > 30]
print(filtered_df)

# Aggregate data by grouping and applying functions
grouped_df = df.groupby('Gender')['Score'].mean()
print(grouped_df)

# Save processed data to a new CSV file
df.to_csv('processed_data.csv', index=False)

Name       0
Age        0
Gender     0
Country    0
Score      0
dtype: int64
      Name  Age  Gender    Country  Score
0     John   25    Male        USA     80
1     Mary   31  Female         UK     90
2    David   42    Male  Australia     70
3    Emily   35  Female     Canada     85
4    Sarah   28  Female    Germany     95
5  Michael   40    Male        USA     75
6     Lisa   29  Female         UK     80
7     Paul   38    Male  Australia     85
8    Laura   32  Female     Canada     90
9    Kevin   45    Male    Germany     70
      Name  Age  Gender    Country  Score
0     John   25    Male        USA     80
1     Mary   31  Female         UK     90
2    David   42    Male  Australia     70
3    Emily   35  Female     Canada     85
4    Sarah   28  Female    Germany     95
5  Michael   40    Male        USA     75
6     Lisa   29  Female         UK     80
7     Paul   38    Male  Australia     85
8    Laura   32  Female     Canada     90
9    Kevin   45    Male    Germany     70
      Name  Age  Gender    Country  Score
0     John   25    Male        USA     80
1     Mary   31  Female         UK     90
2    David   42    Male  Australia     70
3    Emily   35  Female     Canada     85
4    Sarah   28  Female    Germany     95
5  Michael   40    Male        USA     75
6     Lisa   29  Female         UK     80
7     Paul   38    Male  Australia     85
8    Laura   32  Female     Canada     90
9    Kevin   45    Male    Germany     70
      Name  Age  Gender    Country  Score
1     Mary   31  Female         UK     90
2    David   42    Male  Australia     70
3    Emily   35  Female     Canada     85
5  Michael   40    Male        USA     75
7     Paul   38    Male  Australia     85
8    Laura   32  Female     Canada     90
9    Kevin   45    Male    Germany     70
Gender
Female    88.0
Male      76.0
Name: Score, dtype: float64